#### create dataframe

In [3]:
import pandas as pd 
data={"name":["javeed","rahul","kiran"],"No":[1,2,3]}
df=pd.DataFrame(data)
df

     name  No
0  javeed   1
1   rahul   2
2   kiran   3

#### handling null values

In [4]:
import pandas as pd
import numpy as np

data = {
    'ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', np.nan, 'David', 'Eve'],
    'Age': [25, np.nan, 30, 22, np.nan],
    'City': ['New York', 'Los Angeles', 'Chicago', np.nan, 'Houston']
}

df = pd.DataFrame(data)
df

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob   NaN  Los Angeles
2  103    NaN  30.0      Chicago
3  104  David  22.0          NaN
4  105    Eve   NaN      Houston

In [5]:
df.isnull()

      ID   Name    Age   City
0  False  False  False  False
1  False  False   True  False
2  False   True  False  False
3  False  False  False   True
4  False  False   True  False

In [6]:
df.isnull().sum()

ID      0
Name    1
Age     2
City    1
dtype: int64

In [7]:
df.isnull().sum().sum()

4

In [8]:
import pandas as pd
import numpy as np

data = {
    'ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', np.nan, 'David', 'Eve'],
    'Age': [25, np.nan, 30, 22, np.nan],
    'City': ['New York', 'Los Angeles', 'Chicago', np.nan, 'Houston']
}

df = pd.DataFrame(data)
df

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob   NaN  Los Angeles
2  103    NaN  30.0      Chicago
3  104  David  22.0          NaN
4  105    Eve   NaN      Houston

#### filling with some particular value

In [9]:
df1=df.fillna(value=0)

In [10]:
df1

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob   0.0  Los Angeles
2  103      0  30.0      Chicago
3  104  David  22.0            0
4  105    Eve   0.0      Houston

In [12]:
df1.isnull().sum()

ID      0
Name    0
Age     0
City    0
dtype: int64

#### filling with the previous value

In [19]:
df

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob   NaN  Los Angeles
2  103    NaN  30.0      Chicago
3  104  David  22.0          NaN
4  105    Eve   NaN      Houston

In [23]:
fill_previous=df.ffill()

In [24]:
fill_previous

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob  25.0  Los Angeles
2  103    Bob  30.0      Chicago
3  104  David  22.0      Chicago
4  105    Eve  22.0      Houston

In [26]:
back_fill=df.bfill()
back_fill

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob  30.0  Los Angeles
2  103  David  30.0      Chicago
3  104  David  22.0      Houston
4  105    Eve   NaN      Houston

#### ⭐ filling different values in different columns

In [28]:
df

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob   NaN  Los Angeles
2  103    NaN  30.0      Chicago
3  104  David  22.0          NaN
4  105    Eve   NaN      Houston

In [29]:
df_col=df.fillna({"Age":20,"City":"India"})
df_col

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob  20.0  Los Angeles
2  103    NaN  30.0      Chicago
3  104  David  22.0        India
4  105    Eve  20.0      Houston

#### ⭐ filling with the aggragation of that column

In [31]:
df

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob   NaN  Los Angeles
2  103    NaN  30.0      Chicago
3  104  David  22.0          NaN
4  105    Eve   NaN      Houston

In [40]:
df_agg_mean=df.fillna(df["Age"].mean())

In [51]:
df_agg_mean

    ID       Name        Age         City
0  101      Alice  25.000000     New York
1  102        Bob  25.666667  Los Angeles
2  103  25.666667  30.000000      Chicago
3  104      David  22.000000    25.666667
4  105        Eve  25.666667      Houston

In [50]:
df_agg_max=df.fillna(value=df["Age"].max())

In [49]:
df_agg_max

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob  30.0  Los Angeles
2  103   30.0  30.0      Chicago
3  104  David  22.0         30.0
4  105    Eve  30.0      Houston

In [47]:
df_agg_max["Age"] = df_agg_max["Age"].fillna(df_agg_max["Age"].max())

In [48]:
df_agg_max

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob  30.0  Los Angeles
2  103   30.0  30.0      Chicago
3  104  David  22.0         30.0
4  105    Eve  30.0      Houston

In [5]:
import pandas as pd
import numpy as np 
data = {
    'ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', "carles", 'David', 'Eve'],
    'Age': [25, np.nan, 30, 22, np.nan],
    'City': ['New York', 'Los Angeles', 'Chicago', np.nan, 'Houston'],
    "no":[1,2,3,4,5]
}

df = pd.DataFrame(data)
df

    ID    Name   Age         City  no
0  101   Alice  25.0     New York   1
1  102     Bob   NaN  Los Angeles   2
2  103  carles  30.0      Chicago   3
3  104   David  22.0          NaN   4
4  105     Eve   NaN      Houston   5

#### droping the null values

In [6]:
df

    ID    Name   Age         City  no
0  101   Alice  25.0     New York   1
1  102     Bob   NaN  Los Angeles   2
2  103  carles  30.0      Chicago   3
3  104   David  22.0          NaN   4
4  105     Eve   NaN      Houston   5

In [7]:
df_drop=df.dropna()
df_drop

    ID    Name   Age      City  no
0  101   Alice  25.0  New York   1
2  103  carles  30.0   Chicago   3

#### dropingg with any &all

In [70]:
df_any=df.dropna(how="any")
df_any

    ID    Name   Age      City  no
0  101   Alice  25.0  New York   1
2  103  carles  30.0   Chicago   3

In [8]:
df_all=df.dropna(how="all")
df_all

    ID    Name   Age         City  no
0  101   Alice  25.0     New York   1
1  102     Bob   NaN  Los Angeles   2
2  103  carles  30.0      Chicago   3
3  104   David  22.0          NaN   4
4  105     Eve   NaN      Houston   5

In [9]:
import pandas as pd

data = {'A': [10, 20, 30], 'B': [40, 50, 60]}
df = pd.DataFrame(data, index=['a', 'b', 'c'])

# Reindex with a new order
new_index = ['c', 'a', 'b']
df_reindexed = df.reindex(new_index)

print(df_reindexed)

    A   B
c  30  60
a  10  40
b  20  50

#### Reindexing 
##### In Pandas, reindexing refers to the process of changing the index of a DataFrame or Series to a new set of labels

In [10]:
import pandas as pd

data = {'A': [10, 20, 30], 'B': [40, 50, 60]}
df = pd.DataFrame(data, index=['a', 'b', 'c'])
df

    A   B
a  10  40
b  20  50
c  30  60

In [13]:
new_index=["c","b","a"]
new=df.reindex(new_index)
new

    A   B
c  30  60
b  20  50
a  10  40

## concat -vertical join of two data frame

In [18]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({'A': [10, 20], 'B': [30, 40]})

# New row to add
new_row = pd.DataFrame({'A': [50], 'B': [60]})

# Use pd.concat instead of append
df = pd.concat([df, new_row], ignore_index=True)

print(df)

    A   B
0  10  30
1  20  40
2  50  60

## joins--by default it takes left join

In [21]:
import pandas as pd

df1 = pd.DataFrame({'A': [1, 2, 3]}, index=['a', 'b', 'c'])
df2 = pd.DataFrame({'B': [4, 5, 6]}, index=['a', 'b', 'd'])

# Join df2 to df1 (default: left join)
result = df1.join(df2)

result

   A    B
a  1  4.0
b  2  5.0
c  3  NaN

## merge

In [30]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'A': ['X', 'Y', 'Z']})
df2 = pd.DataFrame({'ID': [1, 2, 4], 'B': ['P', 'Q', 'R']})

# Merge on 'ID' column
result=df1.merge(df2,on="ID",how="inner")
print(result)

   ID  A  B
0   1  X  P
1   2  Y  Q

In [47]:
df = pd.DataFrame({
    'ID': [1, 2],
    'Data': [{'name': 'Alice', 'age': 25}, {'name': 'Bob', 'age': 30}]
})

In [48]:
df

   ID                          Data
0   1  {'name': 'Alice', 'age': 25}
1   2    {'name': 'Bob', 'age': 30}

In [71]:
df_flat = pd.json_normalize(df['Data'])
df_flat

    name  age
0  Alice   25
1    Bob   30

In [77]:
res = pd.concat([df.drop(columns=['Data']), df_flat], axis=1)
res

   ID   name  age
0   1  Alice   25
1   2    Bob   30

##